BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega640.PIC
        <edc:SFRDef edc:_addr="0x6F" edc:access="--n-nnnn" edc:cname="TIMSK1" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOIE1" edc:desc="Timer/Counter1 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1A" edc:desc="Timer/Counter1 Output Compare A Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1B" edc:desc="Timer/Counter1 Output Compare B Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1C" edc:desc="Timer/Counter1 Output Compare C Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICIE1" edc:desc="Timer/Counter1 Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x70" edc:access="-----nnn" edc:cname="TIMSK2" edc:nzwidth="0x8" ltx:memberofperipheral="TC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOIE2" edc:desc="Timer/Counter2 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE2A" edc:desc="Timer/Counter2 Output Compare Match A Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE2B" edc:desc="Timer/Counter2 Output Compare Match B Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x71" edc:access="--n-nnnn" edc:cname="TIMSK3" edc:nzwidth="0x8" ltx:memberofperipheral="TC3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOIE3" edc:desc="Timer/Counter3 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE3A" edc:desc="Timer/Counter3 Output Compare A Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE3B" edc:desc="Timer/Counter3 Output Compare B Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE3C" edc:desc="Timer/Counter3 Output Compare C Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICIE3" edc:desc="Timer/Counter3 Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x72" edc:access="--n-nnnn" edc:cname="TIMSK4" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOIE4" edc:desc="Timer/Counter4 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE4A" edc:desc="Timer/Counter4 Output Compare A Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE4B" edc:desc="Timer/Counter4 Output Compare B Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE4C" edc:desc="Timer/Counter4 Output Compare C Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICIE4" edc:desc="Timer/Counter4 Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x73" edc:access="--n-nnnn" edc:cname="TIMSK5" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOIE5" edc:desc="Timer/Counter5 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE5A" edc:desc="Timer/Counter5 Output Compare A Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE5B" edc:desc="Timer/Counter5 Output Compare B Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE5C" edc:desc="Timer/Counter5 Output Compare C Match Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICIE5" edc:desc="Timer/Counter5 Input Capture Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x74" edc:access="nnnnnnnn" edc:cname="XMCRA" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRW0" edc:desc="Wait state select bit lower page" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No wait-states" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Wait one cycle during read/write strobe" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Wait two cycles during read/write strobe" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Wait two cycles during read/write and wait one cycle before driving out new address" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SRW1" edc:desc="Wait state select bit upper page" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No wait-states" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Wait one cycle during read/write strobe" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Wait two cycles during read/write strobe" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Wait two cycles during read/write and wait one cycle before driving out new address" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SRL" edc:desc="Wait state page limit" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="LS = N/A, US = 0x1100 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="LS = 0x2200 - 0x1FFF, US = 0x2000 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="LS = 0x2200 - 0x3FFF, US = 0x4000 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="LS = 0x2200 - 0x5FFF, US = 0x6000 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="LS = 0x2200 - 0x7FFF, US = 0x8000 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="LS = 0x2200 - 0x9FFF, US = 0xA000 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="LS = 0x2200 - 0xBFFF, US = 0xC000 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="LS = 0x2200 - 0xDFFF, US = 0xE000 - 0xFFFF" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SRE" edc:desc="External SRAM Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x75" edc:access="n----nnn" edc:cname="XMCRB" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XMM" edc:desc="External Memory High Mask" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="XMBK" edc:desc="External Memory Bus Keeper Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x76" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x78" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADC" edc:nzwidth="0x10" ltx:memberofperipheral="ADC"/>
        <edc:SFRDef edc:_addr="0x7A" edc:access="nnnnnnnn" edc:cname="ADCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPS" edc:desc="ADC  Prescaler Select Bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="2" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="4" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="8" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="16" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="32" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="64" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="128" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="ADC Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="ADC Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADATE" edc:desc="ADC  Auto Trigger Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADSC" edc:desc="ADC Start Conversion" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="ADC Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7B" edc:access="-n--nnnn" edc:cname="ADCSRB" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADTS" edc:desc="ADC Auto Trigger Source bits" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Free Running mode" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Analog Comparator" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="External Interrupt Request 0" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Timer/Counter0 Compare Match A" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Timer/Counter0 Overflow" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Timer/Counter1 Compare Match B" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Timer/Counter1 Overflow" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Timer/Counter1 Capture Event" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MUX5" edc:desc="Analog Channel and Gain Selection Bits" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ACME" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x7C" edc:access="nnnnnnnn" edc:cname="ADMUX" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MUX" edc:desc="Analog Channel and Gain Selection Bits" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="ADC0" edc:desc="ADC Single Ended Input pin 0" edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ADC1" edc:desc="ADC Single Ended Input pin 1" edc:when="(field &amp; 0x1F) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ADC2" edc:desc="ADC Single Ended Input pin 2" edc:when="(field &amp; 0x1F) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ADC3" edc:desc="ADC Single Ended Input pin 3" edc:when="(field &amp; 0x1F) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ADC4" edc:desc="ADC Single Ended Input pin 4" edc:when="(field &amp; 0x1F) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ADC5" edc:desc="ADC Single Ended Input pin 5" edc:when="(field &amp; 0x1F) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ADC6" edc:desc="ADC Single Ended Input pin 6" edc:when="(field &amp; 0x1F) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="ADC7" edc:desc="ADC Single Ended Input pin 7" edc:when="(field &amp; 0x1F) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC0_10X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 0 10x Gain" edc:when="(field &amp; 0x1F) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC0_10X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 0 10x Gain" edc:when="(field &amp; 0x1F) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC0_200x" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 0 200x Gain" edc:when="(field &amp; 0x1F) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC0_200X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 0 200x Gain" edc:when="(field &amp; 0x1F) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_10X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 10x Gain" edc:when="(field &amp; 0x1F) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_10X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 10x Gain" edc:when="(field &amp; 0x1F) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_200X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 200x Gain" edc:when="(field &amp; 0x1F) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_200X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 200x Gain" edc:when="(field &amp; 0x1F) == 0x0F"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x10"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x11"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x12"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x13"/>
                <edc:SFRFieldSemantic edc:cname="ADC4_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 4 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x14"/>
                <edc:SFRFieldSemantic edc:cname="ADC5_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 5 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x15"/>
                <edc:SFRFieldSemantic edc:cname="ADC6_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 6 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x16"/>
                <edc:SFRFieldSemantic edc:cname="ADC7_ADC1_1X" edc:desc="ADC Differential Inputs Postive pin 7 Negative pin 1 1x Gain" edc:when="(field &amp; 0x1F) == 0x17"/>
                <edc:SFRFieldSemantic edc:cname="ADC0_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 0 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x18"/>
                <edc:SFRFieldSemantic edc:cname="ADC1_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 1 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x19"/>
                <edc:SFRFieldSemantic edc:cname="ADC2_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 2 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1A"/>
                <edc:SFRFieldSemantic edc:cname="ADC3_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 3 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1B"/>
                <edc:SFRFieldSemantic edc:cname="ADC4_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 4 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1C"/>
                <edc:SFRFieldSemantic edc:cname="ADC5_ADC2_1X" edc:desc="ADC Differential Inputs Postive pin 5 Negative pin 2 1x Gain" edc:when="(field &amp; 0x1F) == 0x1D"/>
                <edc:SFRFieldSemantic edc:cname="ADC_VBG" edc:desc="Internal Reference (VBG)" edc:when="(field &amp; 0x1F) == 0x1E"/>
                <edc:SFRFieldSemantic edc:cname="ADC_GND" edc:desc="0V (GND)" edc:when="(field &amp; 0x1F) == 0x1F"/>
                <edc:SFRFieldSemantic edc:cname="ADC8" edc:desc="ADC Single Ended Input pin 8" edc:when="(field &amp; 0x1F) == 0x20"/>
                <edc:SFRFieldSemantic edc:cname="ADC9" edc:desc="ADC Single Ended Input pin 9" edc:when="(field &amp; 0x1F) == 0x21"/>
                <edc:SFRFieldSemantic edc:cname="ADC10" edc:desc="ADC Single Ended Input pin 10" edc:when="(field &amp; 0x1F) == 0x22"/>
                <edc:SFRFieldSemantic edc:cname="ADC11" edc:desc="ADC Single Ended Input pin 11" edc:when="(field &amp; 0x1F) == 0x23"/>
                <edc:SFRFieldSemantic edc:cname="ADC12" edc:desc="ADC Single Ended Input pin 12" edc:when="(field &amp; 0x1F) == 0x24"/>
                <edc:SFRFieldSemantic edc:cname="ADC13" edc:desc="ADC Single Ended Input pin 13" edc:when="(field &amp; 0x1F) == 0x25"/>
                <edc:SFRFieldSemantic edc:cname="ADC14" edc:desc="ADC Single Ended Input pin 14" edc:when="(field &amp; 0x1F) == 0x26"/>
                <edc:SFRFieldSemantic edc:cname="ADC15" edc:desc="ADC Single Ended Input pin 15" edc:when="(field &amp; 0x1F) == 0x27"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC8_10X" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 8 10x Gain" edc:when="(field &amp; 0x1F) == 0x28"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC8_10X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 8 10x Gain" edc:when="(field &amp; 0x1F) == 0x29"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC8_200x" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 8 200x Gain" edc:when="(field &amp; 0x1F) == 0x2A"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC8_200X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 8 200x Gain" edc:when="(field &amp; 0x1F) == 0x2B"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC10_10X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 10 10x Gain" edc:when="(field &amp; 0x1F) == 0x2C"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC10_10X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 10 10x Gain" edc:when="(field &amp; 0x1F) == 0x2D"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC10_200X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 10 200x Gain" edc:when="(field &amp; 0x1F) == 0x2E"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC10_200X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 10 200x Gain" edc:when="(field &amp; 0x1F) == 0x2F"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x30"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x31"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x32"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x33"/>
                <edc:SFRFieldSemantic edc:cname="ADC12_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 12 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x34"/>
                <edc:SFRFieldSemantic edc:cname="ADC13_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 13 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x35"/>
                <edc:SFRFieldSemantic edc:cname="ADC14_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 14 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x36"/>
                <edc:SFRFieldSemantic edc:cname="ADC15_ADC9_1X" edc:desc="ADC Differential Inputs Postive pin 15 Negative pin 9 1x Gain" edc:when="(field &amp; 0x1F) == 0x37"/>
                <edc:SFRFieldSemantic edc:cname="ADC8_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 8 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x38"/>
                <edc:SFRFieldSemantic edc:cname="ADC9_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 9 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x39"/>
                <edc:SFRFieldSemantic edc:cname="ADC10_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 10 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3A"/>
                <edc:SFRFieldSemantic edc:cname="ADC11_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 11 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3B"/>
                <edc:SFRFieldSemantic edc:cname="ADC12_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 12 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3C"/>
                <edc:SFRFieldSemantic edc:cname="ADC13_ADC10_1X" edc:desc="ADC Differential Inputs Postive pin 13 Negative pin 10 1x Gain" edc:when="(field &amp; 0x1F) == 0x3D"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADLAR" edc:desc="Left Adjust Result" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REFS" edc:desc="Reference Selection Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="AREF, Internal Vref turned off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="AVCC with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Internal 1.1V Voltage Reference with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Internal 2.56V Voltage Reference with external capacitor at AREF pin" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
