BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega640.PIC
        <edc:SFRDef edc:_addr="0xD1" edc:access="nnnnnnnn" edc:cname="UCSR2B" edc:nzwidth="0x8" ltx:memberofperipheral="USART2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB82" edc:desc="Transmit Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB82" edc:desc="Receive Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ22" edc:desc="Character Size" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN2" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN2" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE2" edc:desc="USART Data register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE2" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE2" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD2" edc:access="nnnnnnnn" edc:cname="UCSR2C" edc:nzwidth="0x8" ltx:memberofperipheral="USART2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UCPOL2" edc:desc="Clock Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ2" edc:desc="Character Size" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="USBS2" edc:desc="Stop Bit Select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="1-bit" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="2-bit" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UPM2" edc:desc="Parity Mode Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Enabled, Even Parity" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Enabled, Odd Parity" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UMSEL2" edc:desc="USART Mode Select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Asynchronous USART" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Synchronous USART" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Master SPI" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD3" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0xD4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="UBRR2" edc:nzwidth="0x10" ltx:memberofperipheral="USART2"/>
        <edc:SFRDef edc:_addr="0xD6" edc:access="nnnnnnnn" edc:cname="UDR2" edc:nzwidth="0x8" ltx:memberofperipheral="USART2"/>
        <edc:AdjustPoint edc:_addr="0xD7" edc:offset="0x29"/>
        <edc:SFRDef edc:_addr="0x100" edc:access="nnnnnnnn" edc:cname="PINH" edc:nzwidth="0x8" ltx:memberofperipheral="PORTH"/>
        <edc:SFRDef edc:_addr="0x101" edc:access="nnnnnnnn" edc:cname="DDRH" edc:nzwidth="0x8" ltx:memberofperipheral="PORTH"/>
        <edc:SFRDef edc:_addr="0x102" edc:access="nnnnnnnn" edc:cname="PORTH" edc:nzwidth="0x8" ltx:memberofperipheral="PORTH"/>
        <edc:SFRDef edc:_addr="0x103" edc:access="nnnnnnnn" edc:cname="PINJ" edc:nzwidth="0x8" ltx:memberofperipheral="PORTJ"/>
        <edc:SFRDef edc:_addr="0x104" edc:access="nnnnnnnn" edc:cname="DDRJ" edc:nzwidth="0x8" ltx:memberofperipheral="PORTJ"/>
        <edc:SFRDef edc:_addr="0x105" edc:access="nnnnnnnn" edc:cname="PORTJ" edc:nzwidth="0x8" ltx:memberofperipheral="PORTJ"/>
        <edc:SFRDef edc:_addr="0x106" edc:access="nnnnnnnn" edc:cname="PINK" edc:nzwidth="0x8" ltx:memberofperipheral="PORTK"/>
        <edc:SFRDef edc:_addr="0x107" edc:access="nnnnnnnn" edc:cname="DDRK" edc:nzwidth="0x8" ltx:memberofperipheral="PORTK"/>
        <edc:SFRDef edc:_addr="0x108" edc:access="nnnnnnnn" edc:cname="PORTK" edc:nzwidth="0x8" ltx:memberofperipheral="PORTK"/>
        <edc:SFRDef edc:_addr="0x109" edc:access="nnnnnnnn" edc:cname="PINL" edc:nzwidth="0x8" ltx:memberofperipheral="PORTL"/>
        <edc:SFRDef edc:_addr="0x10A" edc:access="nnnnnnnn" edc:cname="DDRL" edc:nzwidth="0x8" ltx:memberofperipheral="PORTL"/>
        <edc:SFRDef edc:_addr="0x10B" edc:access="nnnnnnnn" edc:cname="PORTL" edc:nzwidth="0x8" ltx:memberofperipheral="PORTL"/>
        <edc:AdjustPoint edc:_addr="0x10C" edc:offset="0x14"/>
        <edc:SFRDef edc:_addr="0x120" edc:access="nnnnnnnn" edc:cname="TCCR5A" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WGM5" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="COM5C" edc:desc="Compare Output Mode 5C, bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="COM5B" edc:desc="Compare Output Mode 5B, bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="COM5A" edc:desc="Compare Output Mode 1A, bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x121" edc:access="nn-nnnnn" edc:cname="TCCR5B" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS5" edc:desc="Prescaler source of Timer/Counter 5" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No Clock Source (Stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Running, No Prescaling" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Running, CLK/8" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Running, CLK/64" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Running, CLK/256" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Running, CLK/1024" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Running, ExtClk Tx Falling Edge" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Running, ExtClk Tx Rising Edge" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM5" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES5" edc:desc="Input Capture 5 Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC5" edc:desc="Input Capture 5 Noise Canceler" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x122" edc:access="nnn-----" edc:cname="TCCR5C" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="FOC5C" edc:desc="Force Output Compare 5C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC5B" edc:desc="Force Output Compare 5B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC5A" edc:desc="Force Output Compare 5A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x123" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x124" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT5" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x126" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR5" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x128" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5A" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x12A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5B" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x12C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5C" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:AdjustPoint edc:_addr="0x12E" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x130" edc:access="nnnnnnnn" edc:cname="UCSR3A" edc:nzwidth="0x8" ltx:memberofperipheral="USART3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPCM3" edc:desc="Multi-processor Communication Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2X3" edc:desc="Double the USART transmission speed" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UPE3" edc:desc="Parity Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOR3" edc:desc="Data overRun" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FE3" edc:desc="Framing Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRE3" edc:desc="USART Data Register Empty" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXC3" edc:desc="USART Transmitt Complete" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXC3" edc:desc="USART Receive Complete" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x131" edc:access="nnnnnnnn" edc:cname="UCSR3B" edc:nzwidth="0x8" ltx:memberofperipheral="USART3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB83" edc:desc="Transmit Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB83" edc:desc="Receive Data Bit 8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UCSZ32" edc:desc="Character Size" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN3" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEN3" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UDRIE3" edc:desc="USART Data register Empty Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIE3" edc:desc="TX Complete Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIE3" edc:desc="RX Complete Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
